[
  "Klajdi Hoxhalli \n \n                                                       416-824-4834 | hoxhalliklajdi18@gmail.com \n                      https://www.linkedin.com/in/klajdi-hoxhalli/ |  https://github.com/KlajdiGit \n \n  \nDecember 2, 2025 \nDear Hiring Manager, \n  I am Klajdi Hoxhalli, a graduate student in Honours Bachelor of Computer. The idea of working for a company \nlike Okta is incredibly exciting for me. Working with you would be an accomplishment of my ambition as a solid \nstart of my car",
  "iting for me. Working with you would be an accomplishment of my ambition as a solid \nstart of my career in the IT field in Canada. \n  Over the past three years in Computer Science, I have been studying Object-Oriented Programming languages \nsuch as Python, Java, and C#. Due to my job as a tutor, I’ve been studying C# and Python for over 3 years and \nnot just 1 or 2 semesters. My focus has been particularly on C++, which has allowed me to explore game engines \nlike Unreal Engine. A project which ",
  "ticularly on C++, which has allowed me to explore game engines \nlike Unreal Engine. A project which I am proud of has been the creation of my own Game Engine, which contains \nmechanism to manage assets, data and to render 2D graphics. That course taught me a lot regarding the proper \nmemory management. Moving on, I delved into machine learning techniques and also AI programming where I \nlearned strategies like Minimax algorithms, shortest path, behavior trees, etc. In machine learning I’ve learn",
  "rategies like Minimax algorithms, shortest path, behavior trees, etc. In machine learning I’ve learned \nthe concepts of its variation. A project which I am really proud of is a project where I’ve implemented a simulation \nusing Reinforcement Learning to simulate a race game where I show how to gather data, how to build neural \nnetwork models and how to improve my strategy and improve my ML agents. In all of the classes I’ve learned a \nlot about object-oriented programming and also network progra",
  " In all of the classes I’ve learned a \nlot about object-oriented programming and also network programming where I’ve done my own sockets in C++ \nand C#. \n   In addition to my technical prowess, I have prioritized the development of my communication and collaboration \nskills. I firmly believe that effective communication is key to problem-solving. As a tutor, I have often found myself \nin situations where I neede d to listen attentively to students struggling to articulate their issues. In these ",
  "s where I neede d to listen attentively to students struggling to articulate their issues. In these \ninstances, I would ask them to show their code, identify the problem, and then explain the relevant concepts. \nFurthermore, I have sought assistance from peers and professors when faced with unfamiliar course changes, \ndemonstrating my ability to collaborate and learn from others. To build strong basis, school is not enough. Side \nprojects have always been a part of my studying to equip my self w",
  "asis, school is not enough. Side \nprojects have always been a part of my studying to equip my self with the right understanding of software \ndevelopment. However, I believe that theoretical knowledge needs to be complemented with practical \nexperience. Therefore, I am eager to experience the workings of a professional company like Okta. I am \nconfident that this opportunity will allow me to apply my skills in a real -world setting, further enhancing my \nlearning. \nI am certain that my passion, d",
  "my skills in a real -world setting, further enhancing my \nlearning. \nI am certain that my passion, dedication, and willingness to continually learn and adapt would make me a \nvaluable addition to your team. I look forward to the possibility of discussing my qualifications further. \nThank you for considering my application. \nBest Regards,  \n Klajdi Hoxhalli",
  {
    "doc": "KLAJDI HOXHALLI RESUME.pdf",
    "text": "Klajdi Hoxhalli \n                                           416-824-4834 | hoxhalliklajdi18@gmail.com \n     https://www.linkedin.com/in/klajdi-hoxhalli/ |  https://github.com/KlajdiGit \n \n \nSUMMARY  \n \n      Motivated and personable professional with strong communication and problem-solving skills, eager to bring a customer-first approach \nto retail sales. Experienced in engaging diverse audiences and with ability to learn in a fast-paced environment. Skilled at adapting quickly, \nlearning produ"
  },
  {
    "doc": "KLAJDI HOXHALLI RESUME.pdf",
    "text": " and with ability to learn in a fast-paced environment. Skilled at adapting quickly, \nlearning product details, and help to fulfill customer needs.  \n \nEDUCATION  \nHonours Bachelor of Computer Science (Specialty in Game Engineering)                      \n      Sheridan College, Oakville ON, Sept 2021 – April 2025 \n• Cumulative GPA: 3.7 /4.0. \n B.Sc. in Information Technology      \n      University of Tirana, Albania, Oct 2019 – Jun 2021                                                            "
  },
  {
    "doc": "KLAJDI HOXHALLI RESUME.pdf",
    "text": " of Tirana, Albania, Oct 2019 – Jun 2021                                                                                                                         \n• Cumulative GPA: 9.3/10.0. \n \n \nWORK EXPERIENCE   \nGame Developer (Coop)                                                             \nMetaWorldX, Thornhill ON, April 2024 – Jul 2024  \n• Worked on creating an engaging multiplayer game designed to teach cybersecurity concepts to children in 5 elementary schools \nusing Unreal Engine 5. \n•"
  },
  {
    "doc": "KLAJDI HOXHALLI RESUME.pdf",
    "text": "igned to teach cybersecurity concepts to children in 5 elementary schools \nusing Unreal Engine 5. \n• Collaborated with a team of 2 to brainstorm over 10 game ideas and 5 key features into a cloud environment like AWS, resulting in \na 30% improvement in game performance and scalability. \n• Engineered core gameplay mechanics using C++ for smooth character movement and interactive game objects, enhancing the \noverall game performance. \n• Successfully integrated multiplayer functionalities using Unr"
  },
  {
    "doc": "KLAJDI HOXHALLI RESUME.pdf",
    "text": "cing the \noverall game performance. \n• Successfully integrated multiplayer functionalities using Unreal Engine's RPC (Remote Procedure Call), achieving a 40% increase \nin server-client communication efficiency and enhancing the player experience for over 200 concurrent users. \n• Worked closely with a team of 5 developers using Git and GitHub for effective version control and project management. \n \nCourse/Program Tutor                                                      \nSheridan College, Oakvil"
  },
  {
    "doc": "KLAJDI HOXHALLI RESUME.pdf",
    "text": "\nCourse/Program Tutor                                                      \nSheridan College, Oakville ON, Sept 2022 – April 2024 \n• Tutored around 200 students about concepts in Python and C# in group tutorials, 1-on-on sessions and drop-in sessions.  \n• Designed Group Tutorials approved and revied by 9 professors for every class section to support the students. \n• Assisted in campus events to explain the services provided by the tutoring centre, increasing awareness and engagement among \n400+ "
  },
  {
    "doc": "KLAJDI HOXHALLI RESUME.pdf",
    "text": "plain the services provided by the tutoring centre, increasing awareness and engagement among \n400+ new students. \n \nWaiter                                                     \nLe Treport Wedding Convention Centre, Mississauga ON, Jun 2023 \n• Cleaning and preparing banquet halls. \n• Provide help and service as a waiter towards the customers. \n• Checking that customers are satisfied and if they have any additional request. \n• Maintaining composure in a fast-paced environment. \n \n \nVolunteer Open "
  },
  {
    "doc": "KLAJDI HOXHALLI RESUME.pdf",
    "text": "e any additional request. \n• Maintaining composure in a fast-paced environment. \n \n \nVolunteer Open House                                                     \nSheridan Colleege, Oakville ON \n• Assisted in planning and coordinating student events and orientation activities. \n• Supported event setup, logistics, and registration for campus initiatives. \n• Provided information and guidance to students at campus centres and fairs. \n• Promoted student engagement by collecting feedback and encouraging "
  },
  {
    "doc": "KLAJDI HOXHALLI RESUME.pdf",
    "text": " at campus centres and fairs. \n• Promoted student engagement by collecting feedback and encouraging participation. \n \n \nACHIEVEMENTS AND AWARDS \n• Ranked 3rd among 200 first-year students in the informatics program at University of Tirana. \n• Received a full-tuition scholarship and a monetary award from the University of Tirana and an entrance scholarship from Sheridan College."
  },
  {
    "doc": "Klajdi_Hoxhalli_Cover_Letter_OKTA.pdf",
    "text": "Klajdi Hoxhalli  \n \nMississauga, ON |   416-824-4834 |   hoxhalli@sheridancollege.ca             \n https://www.linkedin.com/in/klajdi-hoxhalli/ |  https://github.com/KlajdiGit \n \n  \nApril 24, 2025 \nDear Hiring Manager, \n  I am Klajdi Hoxhalli, a graduate student in Honours Bachelor of Computer Science ( Specialty in Game \nEngineering). My graduation date is in April-May 2025.The idea of working for a company like OKTA is incredibly \nexciting for me. Working with you would be an accomplishment of"
  },
  {
    "doc": "Klajdi_Hoxhalli_Cover_Letter_OKTA.pdf",
    "text": "r a company like OKTA is incredibly \nexciting for me. Working with you would be an accomplishment of my ambition as a solid start of my career in \nthe IT field in Canada. \n  Over the past three years in Computer Science, I have been studying Object-Oriented Programming languages \nsuch as Python, Java, and C#. Due to my job as a tutor, I’ve been studying C# and Python for over 3 years and \nnot just 1 or 2 semesters. My focus has been particularly on C++, which has allowed me to explore game engin"
  },
  {
    "doc": "Klajdi_Hoxhalli_Cover_Letter_OKTA.pdf",
    "text": " 1 or 2 semesters. My focus has been particularly on C++, which has allowed me to explore game engines \nlike Unreal Engine. A project which I am proud of has been the creation of my own Game Engine, which contains \nmechanism to manage assets, data and to render 2D graphics. That course taught me a lot regarding the proper \nmemory management. Moving on, I delved into machine learning techniques and also AI programming where I \nlearned strategies like Minimax algorithms, shortest path, behavior tr"
  },
  {
    "doc": "Klajdi_Hoxhalli_Cover_Letter_OKTA.pdf",
    "text": " also AI programming where I \nlearned strategies like Minimax algorithms, shortest path, behavior trees, etc. In machine learning I’ve learned \nthe concepts of its variation. A project which I am really proud of is a project where I’ve implemented a simulation \nusing Reinforcement Learning to simulate a race game where I show how to gather data, how to build neural \nnetwork models and how to improve my strategy and improve my ML agents. In all of the classes I’ve learned a \nlot about object-orie"
  },
  {
    "doc": "Klajdi_Hoxhalli_Cover_Letter_OKTA.pdf",
    "text": "ve my strategy and improve my ML agents. In all of the classes I’ve learned a \nlot about object-oriented programming and also network programming where I’ve done my own sockets in C++ \nand C#. \n   In addition to my technical prowess, I have prioritized the development of my communication and collaboration \nskills. I firmly believe that effective communication is key to problem-solving. As a tutor, I have often found myself \nin situations where I neede d to listen attentively to students struggli"
  },
  {
    "doc": "Klajdi_Hoxhalli_Cover_Letter_OKTA.pdf",
    "text": " I have often found myself \nin situations where I neede d to listen attentively to students struggling to articulate their issues. In these \ninstances, I would ask them to show their code, identify the problem, and then explain the relevant concepts. \nFurthermore, I have sought assistance from peers and professors when faced with unfamiliar course changes, \ndemonstrating my ability to collaborate and learn from others. To build strong basis, school is not enough. Side \nprojects have always been "
  },
  {
    "doc": "Klajdi_Hoxhalli_Cover_Letter_OKTA.pdf",
    "text": "and learn from others. To build strong basis, school is not enough. Side \nprojects have always been a part of my studying to equip my self with the right understanding of software \ndevelopment. However, I believe that theoretical knowledge needs to be complemented with practical \nexperience. Therefore, I am eager to experience the workings of a professional company like OKTA. I am \nconfident that this opportunity will allow me to apply my skills in a real -world setting, further enhancing my \nle"
  },
  {
    "doc": "Klajdi_Hoxhalli_Cover_Letter_OKTA.pdf",
    "text": "this opportunity will allow me to apply my skills in a real -world setting, further enhancing my \nlearning. \nI am certain that my passion, dedication, and willingness to continually learn and adapt would make me a \nvaluable addition to your team. I look forward to the possibility of discussing my qualifications further. \nThank you for considering my application. \nBest Regards,  \n Klajdi Hoxhalli"
  },
  {
    "doc": "Resume - After School.pdf",
    "text": "Arta Seify \narta.seify@gmail.com  •  11415 76 Ave, Edmonton, T6G 0K5  •  (587) 974-5695 \nEducation \nM.Sc. in Computer Science – Artificial Intelligence \nUniversity of Alberta, 2020, 4.0 GPA \nB.Sc. in Computer Science – First Class Honors \nUniversity of Calgary, 2017, 3.91 GPA \nRelevant Projects (GitHub.com/ArtaSeify) \nProject written in C++ unless specified. Private repositories are available upon request.  \n• BowMan: Third-person archery game developed using Unreal Engine 4. \n• Dragon-TD: Maze-"
  },
  {
    "doc": "Resume - After School.pdf",
    "text": " request.  \n• BowMan: Third-person archery game developed using Unreal Engine 4. \n• Dragon-TD: Maze-building tower defense game created using Unity and C#.  \n• BOSS-SC2: Build order search for StarCraft II. Performance optimization using profiler. \n• SameGame: Multithreaded search and deep learning. Performance optimization using profiler. \n• CommandCenter: Integration of real-time build order search (BOSS) into an open-source bot. \nTechnical Skills \n• 2+ years’ experience with C++, Python, obje"
  },
  {
    "doc": "Resume - After School.pdf",
    "text": "rch (BOSS) into an open-source bot. \nTechnical Skills \n• 2+ years’ experience with C++, Python, object-oriented programming, parallel computing, \nWindows & Linux \n• Working knowledge of Unreal Engine 4, Unity, C, C#, Java, Docker. \nWork Experience \nTeaching Assistant \nUniversity of Alberta, September 2017 – December 2019 \n• Teaching labs of several courses, including Advanced Games Programming in C++. \n• Writing scripts to automate the testing and grading of Lisp programs. \nResearch Assistant \nU"
  },
  {
    "doc": "Resume - After School.pdf",
    "text": "C++. \n• Writing scripts to automate the testing and grading of Lisp programs. \nResearch Assistant \nUniversity of Alberta, May 2019 – August 2019 \n• Developing scalable machine learning software to train an agent using a supercomputer. \nPartner Dance Instructor \nVarious—Contractor, August 2014 – Present \n• Collaborating with various teaching partners to produce and execute lesson plans. \n• Teaching vernacular jazz dances to people of all ages and skill levels. \nAcademic Achievements \n• Natural Sc"
  },
  {
    "doc": "Resume - After School.pdf",
    "text": " vernacular jazz dances to people of all ages and skill levels. \nAcademic Achievements \n• Natural Sciences & Engineering Research Council of Canada (NSERC) scholarship worth \n$23,300 in 2018. \n• Publication and poster presentation at Reinforcement Learning in Games workshop at \nAssociation for the Advancement of Artificial Intelligence (AAAI) 2020 conference. \n• Presentation on StarCraft II API at the Real-Time Strategy Games workshop in Artificial \nIntelligence and Interactive Digital Entertain"
  },
  {
    "doc": "Resume - After School.pdf",
    "text": " the Real-Time Strategy Games workshop in Artificial \nIntelligence and Interactive Digital Entertainment (AIIDE) 2019 conference."
  }
]